A. Что случилось?
Необходимо восстановить коэффициенты функции 
f
(
x
)
, зная её значения на некотором наборе точек.
При этом известно, что
f
(
x
)
=
(
(
a
+
d
a
)
e
x
+
(
b
+
d
b
)
x
3
∕
4
)
2
+
(
c
+
d
c
)
cos
2
x
,
где 
d
i
 – случайные величины, которые принимают значения из отрезка 
[
−
0
.
0
0
1
,
0
.
0
0
1
]
; 
a
, 
b
, 
c
 – неизвестные вещественные константы, которые требуется найти (абсолютная ошибка не должна превышать 
1
0
−
2
).

Формат ввода
В каждой строке файла https://yadi.sk/d/llKlDyAK982aLQ записаны два числа 
x
 и 
f
(
x
)
, разделённые пробелом.
Формат вывода
Выведите через пробел 
3
 вещественных числа с точностью не менее 
2
 значащих цифр после десятичной точки, которые соответствуют набору 
a
, 
b
, 
c
.

Для восстановления коэффициентов функции нам нужно решить задачу нелинейной регрессии. Используем метод наименьших квадратов, который минимизирует сумму квадратов отклонений между реальными значениями функции и ее аппроксимацией:

S = Σ(f(x_i) - g(x_i))^2,

где f(x_i) - известные значения функции, g(x_i) - аппроксимация функции с неизвестными коэффициентами.

Для данной функции аппроксимацию можно записать как:

g(x) = (ae^x + bx^(3/4))^2 + c*cos^2(x),

где a, b, c - неизвестные коэффициенты.

Положим, что d_a, d_b, d_c - случайные величины со значениями из отрезка [-0.001, 0.001]. Тогда аппроксимацию можно переписать в виде:

g(x) = (ae^x + bx^(3/4) + d_ae^x + d_bx^(3/4))^2 + (c + d_c)*cos^2(x).

Таким образом, мы получили нелинейный параметрический регрессионный алгоритм.

Для решения этой задачи можно воспользоваться библиотекой scipy.optimize, которая умеет решать различные задачи оптимизации, в том числе и задачу нелинейной регрессии.

Пример кода:

import numpy as np
from scipy.optimize import curve_fit

Определяем функцию аппроксимации
def func(x, a, b, c):
d_a = np.random.uniform(-0.001, 0.001)
d_b = np.random.uniform(-0.001, 0.001)
d_c = np.random.uniform(-0.001, 0.001)
return (anp.exp(x) + bx**(3/4) + d_anp.exp(x) + d_bx**(3/4))**2 + (c + d_c)*np.cos(x)**2

Считываем данные
data = np.loadtxt('data.txt')

Определяем начальные параметры для оптимизации
p0 = [1, 1, 1]

Используем метод наименьших квадратов для определения коэффициентов a, b, c
popt, pcov = curve_fit(func, data[:,0], data[:,1], p0)

Выводим результаты
print('{:.2f} {:.2f} {:.2f}'.format(popt[0], popt[1], popt[2]))

Данный код считывает данные из файла data.txt, который содержит пары значений x и f(x). Затем он применяет метод наименьших квадратов для определения коэффициентов a, b, c функции аппроксимации. Результаты выводятся на экран с помощью функции print.
